tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "samtay/tui"
tap "thezoraiz/ascii-image-converter"
tap "zegervdv/zathura"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Highly capable, feature-rich programming language
brew "perl"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Optimized BLAS library
brew "openblas"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# CPU architecture fetching tool
brew "cpufetch"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# File format designed to store large amounts of data
brew "hdf5"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image loading and rendering library
brew "imlib2"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Text-based web browser
brew "lynx"
# Terminal-based visual file manager
brew "midnight-commander"
# Lightweight PDF and XPS viewer
brew "mupdf"
# High-level, dynamically typed programming language
brew "neko"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Python bindings for v6 of Qt
brew "pyqt"
# Open source computer vision library
brew "opencv", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Reads arbitrary PDF files and generates an XML file readable by Ipe
brew "pdftoipe"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Simple terminal-based rapid serial visual presentation (RSVP) reader
brew "speedread"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Dumb downloader that scrapes the web
brew "you-get"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Tetris in your terminal
brew "samtay/tui/tetris"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# Interface library
brew "zegervdv/zathura/girara", args: ["HEAD"]
# PDF viewer
brew "zegervdv/zathura/zathura", args: ["HEAD"]
# MuPDF backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-mupdf"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Android SDK component
cask "android-platform-tools"
cask "font-sf-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Web browser
cask "librewolf"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Simple menu bar app to download YouTube movies
cask "youtube-downloader"
vscode "dracula-theme.theme-dracula"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "katsute.code-background"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ritwickdey.liveserver"
vscode "tetradresearch.vscode-h2o"
vscode "vscodevim.vim"
vscode "zignd.html-css-class-completion"
